app/controllers/categories_controller.rb

SELECT * FROM "categories" LIMIT 30 OFFSET 0
---
  def index
    @categories = Category.paginate :page => params[:page]