app/controllers/exams_controller.rb

INSERT INTO "exams" ("theta", "created_at", "updated_at", "end", "user_id", "category_id", "variance", "thetas") VALUES(NULL, '2009-09-10 18:52:11', '2009-09-10 18:52:11', NULL, 2, 8, NULL, NULL)
SELECT * FROM "exam_allocations" WHERE ("exam_allocations"."category_id" = 8) LIMIT 1
---
  def create
    @exam = Exam.new params[:exam]

    if @exam.save
      flash[:notice] = 'Exam is up and running'
      exam_allocation = ExamAllocation.find_by_category_id @exam.category_id

SELECT * FROM "exams" WHERE ("exams"."id" = 105)
SELECT * FROM "categories" WHERE ("categories"."id" = 8)
SELECT count(*) AS count_all FROM "solutions" WHERE ("solutions".exam_id = 105)
SELECT * FROM "possible_solutions" WHERE ("possible_solutions"."item_id" = '702')
SELECT * FROM "solutions" WHERE ("solutions".exam_id = 107)
---
  def proceed
    @exam = Exam.find session[:exam_id]
    @category = Category.find @exam.category_id
    session[:sequence] = 0 if @exam.solutions.count == 0

    if params[:solution]  # if there is an answer in the queue
      latency = Time.now.to_f - session[:item_start_time]  # calculate latency in seconds
      session[:sequence] += 1  # solution counter

      @content = params[:solution]
      @item_id = params[:solution][:item_id]

      ### Solved item correct? ###
      @no_of_correct_solutions = 0
      PossibleSolution.find_all_by_item_id(@item_id).each do |ps|
        @no_of_correct_solutions += 1 if ps.correct == 1
      end
      correct_solution = 0
      @incorrect_selected = 0
      @content.each do |solution|

SELECT * FROM "items" WHERE ("items"."id" = 702)
SELECT * FROM "levels" WHERE ("levels"."id" = 7)
INSERT INTO "solutions" ("correctness", "sequence", "created_at", "updated_at", "p", "exam_id", "content", "latency", "item_id") VALUES(1, 1, '2009-09-10 18:54:55', '2009-09-10 18:54:55', 0.5, 107, '--- !map:HashWithIndifferentAccess
---
      end

      # calculate P(THETA)
      item_difficulty = Item.find(@item_id).level.difficulty
      p = 1 / (1 + Math.exp(-1.701*(@exam.theta - item_difficulty)))

      @current_solution = Solution.create(  :item_id => @item_id,
                        :exam_id => @exam.id,
                        :latency => latency,
                        :content => @content,
                        :p => p,
                        :sequence => session[:sequence],
                        :correctness => @item_correct )

UPDATE "exams" SET "updated_at" = '2009-09-10 18:56:04', "thetas" = '0.5,1.0,1.5,2.0,2.08436016472587,1.77610797177005,1.87067573475066,1.71943917177272,1.21943917177272,0.938269761229432,0.50019661129634,0.000196611296339966,-0.437692663399292', "theta" = -0.437692663399292 WHERE "id" = 107
---
      (1..session[:sequence]).each { |x| @num_of_items << "#{x}|" }
      # end monitoring code

      @exam.update_attribute :theta, @theta

SELECT "items".* FROM "items" INNER JOIN levels ON levels.id = level_id WHERE (difficulty = -0.5 AND category_id = 9)
---

      # make sure every item is presented only once
      @presented_items = Array.new
      @exam.solutions.each { |s| @presented_items << s.item_id }

SELECT * FROM "exams" WHERE ("exams"."id" = 107)
SELECT * FROM "categories" WHERE ("categories"."id" = 9)
---
  def conclusion
    @exam = Exam.find session[:exam_id]
    @category = Category.find @exam.category_id