app/controllers/exam_allocations_controller.rb

  def list
    student = User.find_by_login(session[:login])
    @exam_allocations = ExamAllocation.find(:all, :conditions => { :student_id => student.id } )
---
SELECT * FROM "users" WHERE ("users"."login" = 'bob') LIMIT 1
SELECT * FROM "exam_allocations" WHERE ("exam_allocations"."student_id" = 2)

  def index
    @exam_allocations = ExamAllocation.paginate :page => params[:page]
---
SELECT * FROM "exam_allocations" LIMIT 30 OFFSET 0