app/controllers/items_controller.rb

  def index
    @categories = Category.all
---
SELECT * FROM "categories"