app/controllers/sessions_controller.rb

SELECT * FROM "users" WHERE ("users"."login" IS NULL) LIMIT 1
SELECT * FROM "exam_allocations" WHERE ("exam_allocations"."student_id" = 2)
---
  def welcome
    student = User.find_by_login(session[:login])
    @exam_allocations = ExamAllocation.find(:all, :conditions => { :student_id => student.id } )