app/controllers/users_controller.rb

  def index
    @users = User.paginate :page => params[:page]
---
SELECT * FROM "users" LIMIT 30 OFFSET 0